/*Μια ψηφιακή συσκευή για τον έλεγχο ασφάλειας ενός κτηρίου επιστρέφει ως τιμή 
έναν ακέραιο αριθμό, τα bit του οποίου ερμηνεύονται ως εξής: τα bit 7, 6, 5, και 
4 προσδιορίζουν το σημείο ελέγχου (16 πιθανοί συνδυασμοί, με τιμές από 0 μέχρι 15), 
τα bit 3 και 2 το είδος του συναγερμού (0-κανένας, 1-φωτιά, 2-παραβίαση, 3-καπνός), 
το bit 1 δείχνει αν η συσκευή λειτουργεί κανονικά (0-πρόβλημα, 1-OK), και το bit 0 
δεν χρησιμοποιείται. Να γραφεί ένα πρόγραμμα το οποίο θα ζητάει τον αριθμό που 
επιστρέφει η συσκευή και θα εμφανίζει τον αύξοντα αριθμό του σημείου ελέγχου 
(από 1 μέχρι 16) καθώς και το είδος του συναγερμού (π.χ. φωτιά). Στην περίπτωση 
που η συσκευή δεν λειτουργεί κανονικά, δεν πρέπει να εμφανίζεται τίποτα, παρά 
μόνο η φράση «Πρόβλημα στη συσκευή».
*/
#include <stdio.h>
int main()
{}