/*Να γραφει ενα προγραμμα το οποιο να δεχεται εναν χαρακτηρα απο το πληκτρολογιο
και να τον επεξεργαζεται ως εξης΅
Αν ο χαρακτηρας ειναι πεςζος λατινικος να τον τυπωνει στην οθονη.
Αν ειναι αριθμητικο ψηφιο (0-9), να εμφανιζει το μηνυμα : Πατηθηκε ενα ψηφιο.
Σε καθε αλλη περιπτωση να μην κανει τιποτα.*/
#include <stdio.h>
int main ()
{
    char a;
    a= getchar ();
    if (a>=97&&a<=122){
        printf("The character is %c",a);
            }
    else if (a>=48&&a<=57){
        printf("A number was pressed");
    }
    else{
        //Do nothing.
    }
    return 0;
}