/*Να γραφει ενα προγραμμα το οποιο να δεχεται εναν χαρακτηρα απο το πληκτρολογιο και να τον επεξεργαζεται ως εξης 
Αν ο χαρακτηρας ειναι αριθμητικος (ψηφιο) να τον εμφανμιζει οπως ειναι .
Αν ειναι αλφαβητικος λατινικος να εμφανιζει τον αμεσως επομενο χαρακτηρα.*/
#include <stdio.h>
int main ()
{
    char a;
    a=getchar();
    if (a>=48&&a<=57)
    {printf ("%c\n", a);}
    else if ((a>=65&&a<=90)||(a>=97&&a<=122))
    {
        if (a!=122&&a!=90)
            {printf("%c\n",a+1);}
        else
            {printf("This was the last letter of the alphabet");}
}
return 0;
}